package cn.test;

/**
 * 快手实习笔试
 */
public class KuaiShou {
    /**
     * 给定两个字符串，已知可以使用三种放式进行变换
     * 1.插入一个字符
     * 2.删除一个字符
     * 3.更改一个字符
     * 请设计一个算法，找到两个字符串之间的经此最小变换，以字符串1转换成字符串2
     *
     * 输入描述：输入两个字符串，字符串的长度<=1000
     * 输出描述：最小变换次数
     */
    public static int minChangeTimes()
    {
        return 0;
    }
    /**
     * 给定两个-100到100的整数x和y，对x只能进行加1，减1，乘2操作，问最少对x进行几次操作能得到y
     * a=3 b=11 可以通过3*2*2-1 3次操作得到11
     * a=5 b=8 可以通过（5-1）*2 2次操作得到8
     *
     * 输入3，11
     * 输出3
     */
    public static int minMathOpera()
    {
        return 1;
    }
    /**
     * 输入N，求N！末尾的第一个非零数字 如6！=720  则结果是2
     *
     * 输入：仅一行 包含一个整数N（0<=10,000,000）
     * 输出：最右边非零值
     */
    public static int getNoneZero()
    {
        return 1;
    }
}
